function [ U2, Lx2, Ly2 ] = secondLenProperties( U1, Lx1, Ly1, lambda, z )
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
% Fourier Properties of the lens in MATLAB
% 
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% input  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% U1: 输入电场
% Lx1: 输入电场x方向尺寸
% Ly1: 输入电场y方向尺寸
% lambda: 激光波长
% z: 第二个透镜的焦距
% 
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% output  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% U2: 输出电场
% Lx2: 输出电场x方向尺寸
% Ly2: 输出电场y方向尺寸
% 
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% warning：ifftshift and fftshift  %%%%%%
% ifftshift是按负方向（向左和向上）做圆周位移；
% fftshift 是将数组或矩阵按正方向（向右和向下）做圆周位移；
% 圆周位移的步长 等于数组或矩阵长度的一半，对于偶数是N/2，对于奇数是（N-1）/2；
% 对于偶数长的数组，fftshift和ifftshift的结果相同，而对于奇数长的数组，两者结果却不一样；
% 所以需要将N 设置为奇数。
% 
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% warning：1i  %%%%%%%%%%%%%%%%%%%%%%%%%%
% 常量中使用1i，表示为矩阵的行向量，也就是：  0.0000 + 1.0000i
% 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    [N, M] = size(U1);
    
    dx = Lx1 / N;
    dy = Ly1 / M;
    
    Lx2 = lambda * z / dx;
    Ly2 = lambda * z / dy;
    
    constant = 1 / (1i * lambda * z);
    
    U2 = constant * fftshift(fft2(ifftshift(U1))) * dx * dy;

end

