function [ U1 ] = GlassCylinder( U0, X, Y, k, f, r )
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
% Glass Cylinder
% 
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% input  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% U0: 平行光的电场（未进入圆柱形玻璃的电场）
% X: x 方向数据
% Y: y 方向数据
% k: 表示光波的波数
% f: 圆柱形玻璃的焦距
% r: 圆柱形玻璃的半径
% 
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% output  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% U1: 通过圆柱形玻璃后的电场
%  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

U1 = U0;

cylinder = @(x, y, r) (x.^2. < r^2) * 1.0;

U1 = U0 .* exp(1i * k / 2 / f * X.^2) .* cylinder(X, Y, r) + U0 .* (1 - cylinder(X, Y, r));

end

